#### KeyBasedTreeEntry Members

---

|  |
| --- |
| KeyBasedTreeEntry Class   Methods   Properties   See Also |

The  KeyBasedTreeEntry  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  KeyBasedTreeEntry |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetChildrenKeys | Gets a collection containing the keys of all children entry objects from this entry. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Key | The key of this entry. |
| Public property | ParentKey | The parent key of this entry. |

# See Also

KeyBasedTreeEntry Class

Autodesk.Revit.DB Namespace